Revit 2024 API
ReinforcementSettings.IsEqual Method
 Checks if Reinforcement Settings is equal to other
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsEqual(
	ReinforcementSettings other
)
Visual Basic
Public Function IsEqual ( _
	other As ReinforcementSettings _
) As Boolean
Visual C++
public:
bool IsEqual(
	ReinforcementSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Structure.ReinforcementSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace